# GetPrimaryViewId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..GetPrimaryViewId Method
View Class See Also
---
Get the id of the primary view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId GetPrimaryViewId()
```

Visual Basic
---
```text
Public Function GetPrimaryViewId As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetPrimaryViewId()
```

# ### Return Value
The id of the primary view, or InvalidElementId if there is no primary view.
# Remarks
The primary view is the view from which a dependent view is created.
# See Also
View Class
Autodesk.Revit.DB Namespace